Revit 2027 API
BuiltInFailures.ExtrusionFailures.CannotDrawExtrusions Property
 Can't make Extrusion.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDrawExtrusions { get; }
Public Shared ReadOnly Property CannotDrawExtrusions As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDrawExtrusions {
	FailureDefinitionId^ get ();
}
static member CannotDrawExtrusions : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ExtrusionFailures Class
Autodesk.Revit.DB Namespace